src/main/resources/deleteUserRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://localhost:8080/testtask/example/com">
    <soapenv:Header/>
    <soapenv:Body>
        <us:deleteUserRequest>
            <us:userLogin>Oleg</us:userLogin>
        </us:deleteUserRequest>
    </soapenv:Body>
</soapenv:Envelope>
